public/notes/20220206230459-mu4e.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mu4e</title>
<meta name="description" content="An Email Client I use in Emacs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://www.haider.gq/base/stylesheet.css"/>
<link href="https://fonts.googleapis.com/css2?family=Roboto+Slab:wght@600&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Roboto" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Lato:wght@900&display=swap" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">
<div class="Haider"><a href='https://www.haider.gq/'>Haider Mirza</a></div> <div class='nav'>
      <div class='links'>
	<a href='https://www.haider.gq'>Home</a>
	<a href='https://www.haider.gq/about/about'>About</a>
	<a href='https://www.haider.gq/repos/repos'>Repos</a>
	<a href='https://www.haider.gq/projects/projects'>Projects</a>
	<a href='https://www.haider.gq/school/school'>School</a>
      </div>
      </div>
</div>
<div id="content" class="content">
<h1 class="title">Mu4e</h1>

<div id="outline-container-org0c7d8a2" class="outline-2">
<h2 id="org0c7d8a2">About</h2>
<div class="outline-text-2" id="text-org0c7d8a2">
<p>
mu4e is an email client for Emacs. It’s based on the mu email indexer/searcher.
</p>
</div>
<div id="outline-container-org65bf7f5" class="outline-3">
<h3 id="org65bf7f5">Links</h3>
<div class="outline-text-3" id="text-org65bf7f5">
<p>
<a href="https://www.emacswiki.org/emacs/mu4e">Emacs Wiki</a>
<a href="https://www.djcbsoftware.nl/code/mu/mu4e/index.html">Mu4e User Manual</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org498be9c" class="outline-2">
<h2 id="org498be9c">Note:</h2>
<div class="outline-text-2" id="text-org498be9c">
</div>
<div id="outline-container-orga4abfca" class="outline-3">
<h3 id="orga4abfca">Note 1</h3>
<div class="outline-text-3" id="text-orga4abfca">
<p>
You could find yourself with this error
Can't exec "aclocal": No such file or directory at /usr/share/autoconf/Autom4te/FileUtils.pm line 326.
</p>

<p>
You fix it with installing automake.
</p>
</div>
</div>
<div id="outline-container-orgb16413c" class="outline-3">
<h3 id="orgb16413c">Note 2</h3>
<div class="outline-text-3" id="text-orgb16413c">
<p>
install Isync and mu-git from the AUR (if using ArchLinux).
Mu4e comes from mu for some reason.
</p>
</div>
</div>
</div>
<div id="outline-container-org2a1d6da" class="outline-2">
<h2 id="org2a1d6da">Important Information</h2>
<div class="outline-text-2" id="text-org2a1d6da">
<p>
On my configuration all of my  Mail is located is in the ~/Mail directory.
Mu4e uses the command "mbsync -a" to sync the EMail.
</p>
</div>
</div>
<div id="outline-container-org56c0051" class="outline-2">
<h2 id="org56c0051">Email Properties</h2>
<div class="outline-text-2" id="text-org56c0051">
<p>
This applys only to my emails however this also works for any other email addresses that use the same provider.
</p>
</div>

<div id="outline-container-orga968fbc" class="outline-3">
<h3 id="orga968fbc">School</h3>
<div class="outline-text-3" id="text-orga968fbc">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Property</th>
<th scope="col" class="org-left">Response</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Email Address</td>
<td class="org-left">ha6mi19@keaston.bham.sch.uk</td>
</tr>

<tr>
<td class="org-left">Full Name</td>
<td class="org-left">Haider Mirza</td>
</tr>

<tr>
<td class="org-left">smtpmail-smtp-server</td>
<td class="org-left">smtp-mail.outlook.com</td>
</tr>

<tr>
<td class="org-left">smtpmail-smtp-service</td>
<td class="org-left">587</td>
</tr>

<tr>
<td class="org-left">stmpmail-stream-type</td>
<td class="org-left">ssl</td>
</tr>

<tr>
<td class="org-left">Folder</td>
<td class="org-left">"<i><i>Outlook</i></i>"</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org174a8b3" class="outline-3">
<h3 id="org174a8b3">Home</h3>
<div class="outline-text-3" id="text-org174a8b3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Property</th>
<th scope="col" class="org-left">Response</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Email Address</td>
<td class="org-left">x7and7@gmail.com</td>
</tr>

<tr>
<td class="org-left">Full Name</td>
<td class="org-left">Haider Mirza</td>
</tr>

<tr>
<td class="org-left">smtpmail-smtp-server</td>
<td class="org-left">smtp.gmail.com</td>
</tr>

<tr>
<td class="org-left">smtpmail-smtp-service</td>
<td class="org-left">465</td>
</tr>

<tr>
<td class="org-left">stmpmail-stream-type</td>
<td class="org-left">ssl</td>
</tr>

<tr>
<td class="org-left">Folder</td>
<td class="org-left">"<i>Gmail/</i>[Gmail]/"</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgc958348" class="outline-2">
<h2 id="orgc958348">How to?</h2>
<div class="outline-text-2" id="text-orgc958348">
<p>
Here are some common "How To" questions.
</p>
</div>
<div id="outline-container-orgef79491" class="outline-3">
<h3 id="orgef79491">How to send a new Email in orgmode</h3>
<div class="outline-text-3" id="text-orgef79491">
<p>
You start typing your address but when it comes to the actual composing part,
do M-x and type org-mime-edit-mail-in-org-mode to open a new buffer that you can type your org Text in.
C-c C-c to put the text into your email and hides the org buffer then do M-x again and type org-mime-htmlize to convert it to html
and keeps the original if some email clients dont have support for html. And like you know C-c and C-c sends the email.
</p>
</div>
</div>
</div>

<div id="outline-container-org6d60657" class="outline-2">
<h2 id="org6d60657">How to attach a file</h2>
<div class="outline-text-2" id="text-org6d60657">
<p>
When composing, go into the text area and do the command C-c C-a to attach a file.
</p>
</div>
</div>
<div id="outline-container-org91d5e52" class="outline-2">
<h2 id="org91d5e52">How to send a existing org document as a Email</h2>
<div class="outline-text-2" id="text-org91d5e52">
<p>
Go to the file and do M-x and type org-mime-org-buffer-htmlize. Press no if it asks to evaluate the buffer.
Then you have a new window showing the email (This is in the normal email buffer not the buffer where you compose email inside Mu4e)
with the org document already in HTML. ( Do the rest of the steps only if you want the email to be composed/sent inside Mu4e )
Then do M-x again and type mu4e-compose-mode to convert it from a normal email buffer to a buffer where you compose inside of Mu4e.
</p>
</div>
</div>

<div id="outline-container-org8914cfa" class="outline-2">
<h2 id="org8914cfa">How to send a subtree as a Email</h2>
<div class="outline-text-2" id="text-org8914cfa">
<p>
Go inside the subtree and then do M-x and type org-mime-org-subtree-htmlize and this will take this * only only the top tree AND it's subtrees included in the tree. (Optional (Turning normal email buffer to Mu4e's)) Do M-x again and type in Mu4e-compose-mode to go into the mu4e buffer not emac's inbuilt. And as the name suggests it turns to HTML.
</p>
</div>
<div id="outline-container-orgf75966b" class="outline-3">
<h3 id="orgf75966b">Note</h3>
<div class="outline-text-3" id="text-orgf75966b">
<p>
The Header for the subtree gets put automatically as the title and then the subtree (without the Header) gets put into the main part of the email.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Made with Org mode 9.4.4 using the power of Emacs 27.2</p>
</div>
</body>
</html>
